Tekla Open API Reference for Tekla Structures 2025
Solid.IsValid Method
 Returns if the solid is valid.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsValid()
Public Function IsValid As Boolean
Return Value
Type: Boolean
The validity of the solid.
See Also
Reference
Solid Class
Tekla.Structures.Model Namespace